project_name/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1 WHERE "users"."id" = $2  [["username", "Joseph"], ["id", 28]]
---
    def update
        user = User.find(params[:id])
        user.update(user_params)